; domain
(define (domain rapunzel_story)
(:requirements :typing :existential-preconditions :negative-preconditions :universal-preconditions :equality :disjunctive-preconditions :conditional-effects)
(:types
    person
    location
)

(:predicates
    (has_long_hair ?p - person)
    (has_cut_hair ?p - person)
    (has_ladder ?p - person)
    (inside_tower ?p - person)
    (in ?p - person ?l - location)
    (like ?p1 ?p2 - person)
    (married ?p1 ?p2 - person)
    (connected ?l1 ?l2 - location)
    (family ?p1 ?p2 - person)
    (hurt ?p - person)
    (isTower ?l - location)
)

(:action climb_tower
    :parameters (?p1 ?p2 - person)
    :precondition (and
    (or (has_long_hair ?p2) (has_cut_hair ?p2) (has_ladder ?p2))
    (inside_tower ?p2)
    (not (inside_tower ?p1))
    (exists (?l - location) (and (isTower ?l) (in ?p1 ?l) (in ?p2 ?l)))
    (not (= ?p1 ?p2))
    )
    :effect 
        (inside_tower ?p1)
    
)


(:action walk
    :parameters (?p - person ?l1 ?l2 - location)
    :precondition (and
        (in ?p ?l1)
        (connected ?l1 ?l2)
        (not (inside_tower ?p))
    )
    :effect (and 
        (in ?p ?l2)  
        (not (in ?p ?l1))
    )
)

(:action grow_hair
    :parameters (?p - person)
    :precondition (and
        (not (has_long_hair ?p))
    )
    :effect (and 
        (has_long_hair ?p)
    )
)


(:action descend_tower
    :parameters (?p1 ?p2 - person)
    :precondition (and
        (or (has_long_hair ?p2) (has_cut_hair ?p2) (has_ladder ?p2))
        (inside_tower ?p2)
        (inside_tower ?p1)
        (not (= ?p1 ?p2))
    )
    :effect (and
        (not (inside_tower ?p1))
    )
)

(:action jump_down_tower
    :parameters (?p - person)
    :precondition (and 
        (not (has_ladder ?p)) 
        (not (has_cut_hair ?p))
        (inside_tower ?p)
    )
    :effect (and 
        (not (inside_tower ?p)) 
        (hurt ?p)
    )
)


(:action climb_up_ladder
    :parameters (?p - person)
    :precondition (and 
        (has_ladder ?p) 
        (not (inside_tower ?p))
        (exists (?l - location) (and (isTower ?l) (in ?p ?l)))
    )
    :effect (and 
        (inside_tower ?p) 
    )
)
 
(:action climb_down_ladder
    :parameters (?p - person)
    :precondition (and 
        (has_ladder ?p) 
        (inside_tower ?p)
    )
    :effect (and 
        (not (inside_tower ?p)) 
    )
)

(:action climb_up_hair
    :parameters (?p - person)
    :precondition (and 
        (has_cut_hair ?p) 
        (not (inside_tower ?p))
        (exists (?l - location) (and (isTower ?l) (in ?p ?l)))
    )
    :effect (and 
        (inside_tower ?p) 
    )
)
 
(:action climb_down_hair
    :parameters (?p - person)
    :precondition (and 
        (has_cut_hair ?p) 
        (inside_tower ?p)
    )
    :effect (and 
        (not (inside_tower ?p)) 
    )
)

(:action serenade
    :parameters (?p - person ?l - location)
    :precondition  
        (in ?p ?l)
   
    :effect (and 
        (forall (?p2 - person) (when (and (in ?p2 ?l) (not (= ?p ?p2))) (like ?p2 ?p)))
    )
)

(:action sweet_talk 
    :parameters (?p1 ?p2 - person)
    :precondition (and
        (like ?p1 ?p2)       
        (exists (?l - location) (and
            (in ?p1 ?l) 
            (in ?p2 ?l)
        ))
        (not (= ?p1 ?p2))
    )
    :effect (and 
        (like ?p2 ?p1)    
    )
)

(:action cut_hair
    :parameters (?p1 ?p2 - person)
    :precondition (and 
        (has_long_hair ?p2)
        (exists (?l - location)
            (and
                (in ?p1 ?l)
                (in ?p2 ?l)
                (or (and (inside_tower ?p1) (inside_tower ?p2)) (and (not (inside_tower ?p1)) (not (inside_tower ?p1))))
            ) 
        )

    )
    :effect (and 
        (not (has_long_hair ?p2)) 
        (has_cut_hair ?p1)
        
    )
)

(:action marry
    :parameters (?p1 ?p2 - person)
    :precondition (and 
        (like ?p1 ?p2) 
        (like ?p2 ?p1)
        (not (family ?p1 ?p2))
        (exists (?l - location) (and
                (in ?p1 ?l) 
                (in ?p2 ?l)
        )
        )
        (not (married ?p1 ?p2))
        (not (married ?p2 ?p1))
    )
    :effect (and 
        (married ?p1 ?p2)
    )
)

(:action give_ladder
    :parameters (?p1 ?p2 - person)
    :precondition (and 
        (has_ladder ?p1) 
        (like ?p1 ?p2)
        (not (= ?p1 ?p2))
        (exists (?l - location) (and
            (in ?p1 ?l) 
            (in ?p2 ?l)
        ))
    )
    :effect (and
        (not (has_ladder ?p1)) 
        (has_ladder ?p2)
        (like ?p2 ?p1)
    )
)


)

; problem
(define (problem rapunzel_problem) (:domain rapunzel_story)
(:objects
    capital_rapunzels_father - person
    capital_rapunzels_mother - person
    capital_rapunzel - person
    the_prince - person
    the_king - person
    the_enchantress - person
    garden - location
    tower - location
    forest - location
    castle - location
    house - location
)
(:init 
    (has_long_hair capital_rapunzel)
    (in capital_rapunzel tower)
    (inside_tower capital_rapunzel)
    (in the_enchantress tower)
    (inside_tower the_enchantress)
    (isTower tower)

    (not (has_long_hair capital_rapunzels_father))
    (not (has_long_hair capital_rapunzels_mother))
    (not (has_long_hair the_enchantress))
    (not (has_long_hair the_prince))
    (not (has_long_hair the_king))

    (not (inside_tower capital_rapunzels_father))
    (not (inside_tower capital_rapunzels_mother))
    (not (inside_tower the_prince))
    (not (inside_tower the_king))
    

    (connected forest tower)
    (connected tower forest)
    (connected forest castle)
    (connected castle forest)
    (connected house garden)
    (connected garden house)
    (connected forest house) 
    (connected house forest)

    (in capital_rapunzels_father house)
    (in capital_rapunzels_mother house)
    (in the_prince castle)
    (in the_king castle)
    (has_ladder the_king)
    (married capital_rapunzels_father capital_rapunzels_mother)


    (family capital_rapunzels_father capital_rapunzel)
    (family capital_rapunzels_mother capital_rapunzel)
    (family the_king the_prince)
    
    (like the_prince the_king)
    (like capital_rapunzels_father capital_rapunzels_mother)
    (like capital_rapunzels_mother capital_rapunzels_father)
    (not (like capital_rapunzels_father the_enchantress))
    (not (like capital_rapunzels_mother the_enchantress))

    ; the_enchantress hates everyone
    (not (like the_enchantress capital_rapunzel))
    (not (like the_enchantress capital_rapunzels_father))
    (not (like the_enchantress capital_rapunzels_mother))
    (not (like the_enchantress the_prince))
    (not (like the_enchantress the_king))
    (not (like the_enchantress the_enchantress))

    (has_ladder the_king)
    


)
(:goal (and
    ;the_enchantress becomes new capital_rapunzel
    (married capital_rapunzel the_prince)
    (in capital_rapunzel castle)
    (hurt the_prince)
    (not (hurt capital_rapunzel))

    ;the_enchantress enchants capital_rapunzels_father 
    ;(married capital_rapunzel the_prince)
    ;(in capital_rapunzel house)
    ;(has_long_hair capital_rapunzels_mother)
    ;(has_ladder the_enchantress)
    ;(not (like the_king the_enchantress))
    ;(not (hurt capital_rapunzel))

    ;(not (hurt capital_rapunzel))
    ;(not (hurt the_prince))
    ;(not (hurt the_enchantress))
    ;(not (hurt the_king))
    ;(not (hurt capital_rapunzels_father))
    ;(not (hurt capital_rapunzels_mother))
    
    ;(in the_enchantress garden)
    ;(in capital_rapunzel forest )
    ;(in capital_rapunzels_mother tower)
    ;(in capital_rapunzels_father tower)
    ;(in the_king garden)
    ;(has_ladder capital_rapunzels_mother)

    ;(hurt capital_rapunzel)
    ;(hurt the_prince)
    ;(hurt the_enchantress)
    ;(hurt the_king)
    ;(hurt capital_rapunzels_father)
    ;(hurt capital_rapunzels_mother)
)
)
)

; plan
1. (cut_hair capital_rapunzel capital_rapunzel)
   deleted: (has_long_hair capital_rapunzel)
   added: (has_cut_hair capital_rapunzel)
   goals met: 1 of 4
2. (climb_down_hair capital_rapunzel)
   deleted: (inside_tower capital_rapunzel)
   goals met: 1 of 4
3. (walk capital_rapunzel tower forest)
   deleted: (in capital_rapunzel tower)
   added: (in capital_rapunzel forest)
   goals met: 1 of 4
4. (walk capital_rapunzel forest castle)
   deleted: (in capital_rapunzel forest)
   added: (in capital_rapunzel castle)
   goals met: 2 of 4
5. (serenade the_prince castle)
   added: (like capital_rapunzel the_prince) (like the_king the_prince)
   goals met: 2 of 4
6. (sweet_talk capital_rapunzel the_prince)
   added: (like the_prince capital_rapunzel)
   goals met: 2 of 4
7. (marry capital_rapunzel the_prince)
   added: (married capital_rapunzel the_prince)
   goals met: 3 of 4
8. (walk the_prince castle forest)
   deleted: (in the_prince castle)
   added: (in the_prince forest)
   goals met: 3 of 4
9. (walk the_prince forest tower)
   deleted: (in the_prince forest)
   added: (in the_prince tower)
   goals met: 3 of 4
10. (grow_hair the_enchantress)
   added: (has_long_hair the_enchantress)
   goals met: 3 of 4
11. (climb_tower the_prince the_enchantress)
   added: (inside_tower the_prince)
   goals met: 3 of 4
12. (jump_down_tower the_prince)
   deleted: (inside_tower the_prince)
   added: (hurt the_prince)
   goals met: 4 of 4
